## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/7010405448)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 2 to add, 12 to change, 2 to destroy.</code></pre>

* Update
  * module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry
  * module.cors_proxy.google_cloud_run_service.cors_proxy
  * module.github_webhook_gateway.google_cloud_run_service.github_webhook_gateway
  * module.secrets_leaks_log_scanner.google_cloud_run_service.gcs_bucket_mover
  * module.secrets_leaks_log_scanner.google_cloud_run_service.github_issue_finder
  * module.secrets_leaks_log_scanner.google_cloud_run_service.secrets_leak_log_scanner
  * module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.gcs_bucket_mover
  * module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.github_issue_creator
  * module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.github_issue_finder
  * module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.secrets_leak_log_scanner
  * module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner
  * module.slack_message_sender.google_cloud_run_service.slack_message_sender
* Replace
  * module.secrets_leaks_log_scanner.google_project_iam_member.project_log_writer
  * module.secrets_leaks_log_scanner.google_project_iam_member.project_workflows_invoker



<details><summary>Change Result (Click me)</summary>

```hcl

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact_registry" {
        id               = "projects/kyma-project/locations/europe/repositories/modules-internal"
        name             = "modules-internal"
        # (11 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # module.cors_proxy.google_cloud_run_service.cors_proxy will be updated in-place
  ~ resource "google_cloud_run_service" "cors_proxy" {
        id                         = "locations/europe-west3/namespaces/sap-kyma-prow/services/cors-proxy"
        name                       = "cors-proxy"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/cors-proxy:v20231124-c630bdd1" -> "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/cors-proxy:v20231127-09e98a14"
                    # (2 unchanged attributes hidden)

                    # (6 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.github_webhook_gateway.google_cloud_run_service.github_webhook_gateway will be updated in-place
  ~ resource "google_cloud_run_service" "github_webhook_gateway" {
        id                         = "locations/europe-west3/namespaces/sap-kyma-prow/services/github-webhook-gateway"
        name                       = "github-webhook-gateway"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/github-webhook-gateway:v20231124-c630bdd1" -> "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/github-webhook-gateway:v20231127-09e98a14"
                    # (2 unchanged attributes hidden)

                    # (12 unchanged blocks hidden)
                }

                # (2 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.secrets_leaks_log_scanner.data.google_iam_policy.run_invoker will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_iam_policy" "run_invoker" {
      + id          = (known after apply)
      + policy_data = (known after apply)

      + binding {
          + members = [
              + "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
            ]
          + role    = "roles/run.invoker"
        }
    }

  # module.secrets_leaks_log_scanner.data.google_project.project will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.secrets_leaks_log_scanner.data.google_secret_manager_secret.gh_tools_kyma_bot_token will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_secret_manager_secret" "gh_tools_kyma_bot_token" {
      + annotations           = (known after apply)
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = (known after apply)
      + name                  = (known after apply)
      + replication           = (known after apply)
      + rotation              = (known after apply)
      + secret_id             = "trusted_default_kyma-bot-github-sap-token"
      + terraform_labels      = (known after apply)
      + topics                = (known after apply)
      + ttl                   = (known after apply)
      + version_aliases       = (known after apply)
    }

  # module.secrets_leaks_log_scanner.data.google_storage_bucket.kyma_prow_logs will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_storage_bucket" "kyma_prow_logs" {
      + autoclass                   = (known after apply)
      + cors                        = (known after apply)
      + custom_placement_config     = (known after apply)
      + default_event_based_hold    = (known after apply)
      + effective_labels            = (known after apply)
      + encryption                  = (known after apply)
      + force_destroy               = (known after apply)
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + lifecycle_rule              = (known after apply)
      + location                    = (known after apply)
      + logging                     = (known after apply)
      + name                        = "kyma-prow-logs"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + requester_pays              = (known after apply)
      + retention_policy            = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = (known after apply)
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
      + versioning                  = (known after apply)
      + website                     = (known after apply)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service.gcs_bucket_mover will be updated in-place
  ~ resource "google_cloud_run_service" "gcs_bucket_mover" {
        id                         = "locations/europe-west3/namespaces/sap-kyma-prow/services/gcs-bucket-mover"
        name                       = "gcs-bucket-mover"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/move-gcs-bucket:v20231124-c630bdd1" -> "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/move-gcs-bucket:v20231127-09e98a14"
                    # (2 unchanged attributes hidden)

                    # (9 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service.github_issue_finder will be updated in-place
  ~ resource "google_cloud_run_service" "github_issue_finder" {
        id                         = "locations/europe-west3/namespaces/sap-kyma-prow/services/github-issue-finder"
        name                       = "github-issue-finder"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/search-github-issue:v20231124-c630bdd1" -> "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/search-github-issue:v20231127-09e98a14"
                    # (2 unchanged attributes hidden)

                    # (11 unchanged blocks hidden)
                }

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service.secrets_leak_log_scanner will be updated in-place
  ~ resource "google_cloud_run_service" "secrets_leak_log_scanner" {
        id                         = "locations/europe-west3/namespaces/sap-kyma-prow/services/secrets-leak-log-scanner"
        name                       = "secrets-leak-log-scanner"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/scan-logs-for-secrets:v20231124-c630bdd1" -> "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/scan-logs-for-secrets:v20231127-09e98a14"
                    # (2 unchanged attributes hidden)

                    # (7 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.gcs_bucket_mover will be updated in-place
  ~ resource "google_cloud_run_service_iam_policy" "gcs_bucket_mover" {
        id          = "v1/projects/sap-kyma-prow/locations/europe-west3/services/gcs-bucket-mover"
      ~ policy_data = jsonencode(
            {
              - bindings = [
                  - {
                      - members = [
                          - "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      - role    = "roles/run.invoker"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.github_issue_creator will be updated in-place
  ~ resource "google_cloud_run_service_iam_policy" "github_issue_creator" {
        id          = "v1/projects/sap-kyma-prow/locations/europe-west3/services/github-issue-creator"
      ~ policy_data = jsonencode(
            {
              - bindings = [
                  - {
                      - members = [
                          - "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      - role    = "roles/run.invoker"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.github_issue_finder will be updated in-place
  ~ resource "google_cloud_run_service_iam_policy" "github_issue_finder" {
        id          = "v1/projects/sap-kyma-prow/locations/europe-west3/services/github-issue-finder"
      ~ policy_data = jsonencode(
            {
              - bindings = [
                  - {
                      - members = [
                          - "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      - role    = "roles/run.invoker"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.secrets_leak_log_scanner will be updated in-place
  ~ resource "google_cloud_run_service_iam_policy" "secrets_leak_log_scanner" {
        id          = "v1/projects/sap-kyma-prow/locations/europe-west3/services/secrets-leak-log-scanner"
      ~ policy_data = jsonencode(
            {
              - bindings = [
                  - {
                      - members = [
                          - "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      - role    = "roles/run.invoker"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_project_iam_member.project_log_writer must be replaced
-/+ resource "google_project_iam_member" "project_log_writer" {
      ~ etag    = "BwYK5Kse25k=" -> (known after apply)
      ~ id      = "projects/sap-kyma-prow/roles/logging.logWriter/serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com" -> (known after apply)
      ~ project = "projects/sap-kyma-prow" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_project_iam_member.project_workflows_invoker must be replaced
-/+ resource "google_project_iam_member" "project_workflows_invoker" {
      ~ etag    = "BwYK5Kse25k=" -> (known after apply)
      ~ id      = "projects/sap-kyma-prow/roles/workflows.invoker/serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com" -> (known after apply)
      ~ project = "projects/sap-kyma-prow" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner will be updated in-place
  ~ resource "google_cloud_scheduler_job" "service_account_keys_cleaner" {
        id               = "projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner"
        name             = "service-account-keys-cleaner"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ uri         = "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app/?project=sap-kyma-prow&age=24" -> "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app?project=sap-kyma-prow&age=24"
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.slack_message_sender.google_cloud_run_service.slack_message_sender will be updated in-place
  ~ resource "google_cloud_run_service" "slack_message_sender" {
        id                         = "locations/europe-west3/namespaces/sap-kyma-prow/services/slack-message-sender"
        name                       = "slack-message-sender"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-docker.pkg.dev/kyma-project/prod/test-infra/slackmessagesender:v20231124-53325c53" -> "europe-docker.pkg.dev/kyma-project/prod/test-infra/slackmessagesender:v20231127-09e98a14"
                    # (2 unchanged attributes hidden)

                    # (12 unchanged blocks hidden)
                }

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 12 to change, 2 to destroy.

Changes to Outputs:
  ~ artifact_registry                                   = {
      ~ modules-internal = {
          ~ artifact_registry_collection = {
                id                        = "projects/kyma-project/locations/europe/repositories/modules-internal"
                name                      = "modules-internal"
              ~ update_time               = "2023-11-27T08:43:23.766320Z" -> "2023-11-27T12:45:57.258056Z"
                # (16 unchanged attributes hidden)
            }
        }
    }
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":9404,"Program":"tfcmt","SHA1":"b31203c9c2b73ee5cdbc49910cc09fca45f7e6a3","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->